<a href="https://colab.research.google.com/github/kptej/MyLearning/blob/main/spark_sql_examples.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SPARK SQL

In [69]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.11/dist-packages (3.5.1)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.11/dist-packages (from pyspark) (0.10.9.7)

In [70]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName("DataFrameExample").getOrCreate()

data = [("Alice", 25),
        ("Bob", 30),
        ("Charlie", 22),
        ("David", 35),
        ("Eve", 28),
        ("Frank", 40),
        ("Grace", 23),
        ("Heidi", 31),
        ("Ivan", 27),
        ("Judy", 29)]

columns = ["Name", "Age"]

In [71]:
#todf create df using todf
df = spark.sparkContext.parallelize(data).toDF() #no clolumns it takes by default
df.show()

df1 = spark.sparkContext.parallelize(data).toDF(columns)#coloumns assgigned
df1.show()

+-------+---+
|     _1| _2|
+-------+---+
|  Alice| 25|
|    Bob| 30|
|Charlie| 22|
|  David| 35|
|    Eve| 28|
|  Frank| 40|
|  Grace| 23|
|  Heidi| 31|
|   Ivan| 27|
|   Judy| 29|
+-------+---+

+-------+---+
|   Name|Age|
+-------+---+
|  Alice| 25|
|    Bob| 30|
|Charlie| 22|
|  David| 35|
|    Eve| 28|
|  Frank| 40|
|  Grace| 23|
|  Heidi| 31|
|   Ivan| 27|
|   Judy| 29|
+-------+---+

In [72]:
from_df = df.toDF("names", "age")#column names passed

df.show()#default columns
from_df.show()

+-------+---+
|     _1| _2|
+-------+---+
|  Alice| 25|
|    Bob| 30|
|Charlie| 22|
|  David| 35|
|    Eve| 28|
|  Frank| 40|
|  Grace| 23|
|  Heidi| 31|
|   Ivan| 27|
|   Judy| 29|
+-------+---+

+-------+---+
|  names|age|
+-------+---+
|  Alice| 25|
|    Bob| 30|
|Charlie| 22|
|  David| 35|
|    Eve| 28|
|  Frank| 40|
|  Grace| 23|
|  Heidi| 31|
|   Ivan| 27|
|   Judy| 29|
+-------+---+

In [73]:
employee_data = [
    ("Alice", 25, "Engineering", 60000),
    ("Bob", 30, "Sales", 70000),
    ("Charlie", 22, "Marketing", 55000),
    ("David", 35, "Engineering", 75000),
    ("Eve", 28, "Sales", 65000),
    ("Frank", 40, "Human Resources", 80000),
    ("Grace", 23, "Marketing", 58000),
    ("Heidi", 31, "Engineering", 72000),
    ("Ivan", 27, "Sales", 68000),
    ("Judy", 29, "Human Resources", 78000),
    ("Kevin", 26, "Engineering", 62000),
    ("Liam", 33, "Marketing", 60000),
    ("Mia", 24, "Sales", 63000),
    ("Noah", 38, "Engineering", 85000),
    ("Olivia", 32, "Human Resources", 82000),
    ("Peter", 21, "Marketing", 52000),
    ("Quinn", 36, "Sales", 72000),
    ("Riley", 29, "Engineering", 70000),
    ("Sophia", 27, "Human Resources", 75000),
    ("Thomas", 34, "Marketing", 65000)
]

employee_table = ["Name", "Age", "Department", "Salary"]

#create dataframe
employee_df_with_salary = spark.createDataFrame(employee_data, employee_table)
employee_df_with_salary.show()

+-------+---+---------------+------+
|   Name|Age|     Department|Salary|
+-------+---+---------------+------+
|  Alice| 25|    Engineering| 60000|
|    Bob| 30|          Sales| 70000|
|Charlie| 22|      Marketing| 55000|
|  David| 35|    Engineering| 75000|
|    Eve| 28|          Sales| 65000|
|  Frank| 40|Human Resources| 80000|
|  Grace| 23|      Marketing| 58000|
|  Heidi| 31|    Engineering| 72000|
|   Ivan| 27|          Sales| 68000|
|   Judy| 29|Human Resources| 78000|
|  Kevin| 26|    Engineering| 62000|
|   Liam| 33|      Marketing| 60000|
|    Mia| 24|          Sales| 63000|
|   Noah| 38|    Engineering| 85000|
| Olivia| 32|Human Resources| 82000|
|  Peter| 21|      Marketing| 52000|
|  Quinn| 36|          Sales| 72000|
|  Riley| 29|    Engineering| 70000|
| Sophia| 27|Human Resources| 75000|
| Thomas| 34|      Marketing| 65000|
+-------+---+---------------+------+

In [74]:
#print schema
employee_df_with_salary.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: long (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: long (nullable = true)

In [75]:
print(employee_df_with_salary.count())
len(employee_df_with_salary.columns)

20

4

In [76]:
#print type of rdd
print(type(employee_df_with_salary))

<class 'pyspark.sql.dataframe.DataFrame'>

In [77]:
employee_df_with_salary.first()
employee_df_with_salary.take(5)

[Row(Name='Alice', Age=25, Department='Engineering', Salary=60000),
 Row(Name='Bob', Age=30, Department='Sales', Salary=70000),
 Row(Name='Charlie', Age=22, Department='Marketing', Salary=55000),
 Row(Name='David', Age=35, Department='Engineering', Salary=75000),
 Row(Name='Eve', Age=28, Department='Sales', Salary=65000)]

# **importing data from kaggle**

https://www.kaggle.com/datasets/baiqi301/employee-details/data

download any kind of data set from kaggle and mount the dataset from kaggle to spark API to fetch the dataset.

In [78]:
#importing data from kaggle by mounting the dataset.

# Install dependencies as needed:
# pip install kagglehub[pandas-datasets]
import kagglehub
from kagglehub import KaggleDatasetAdapter

# Set the path to the file you'd like to load
file_path = "employee_data.csv"

# Load the latest version
df = kagglehub.load_dataset(
  KaggleDatasetAdapter.PANDAS,
  "baiqi301/employee-details",
  file_path,
  # Provide any additional arguments like
  # sql_query or pandas_kwargs. See the
  # documenation for more information:
  # https://github.com/Kaggle/kagglehub/blob/main/README.md#kaggledatasetadapterpandas
)

print("First 5 records:", df.head())

<ipython-input-78-0fac7ee7b3e2>:12: DeprecationWarning: load_dataset is deprecated and will be removed in a future version.
  df = kagglehub.load_dataset(

First 5 records:    Employee_ID              Name  Age  Gender                      Email  \
0            1     Brian Garrett   35    Male    montestammy@example.net
1            2      Isaac Walker   48  Female  crystalmolina@example.com
2            3  Kristin Friedman   27  Female      rachael41@example.net
3            4   Clinton Serrano   24  Female         john42@example.net
4            5   Tammy Armstrong   35  Female        qfuller@example.com

                                             Address Department  \
0  8977 Reid Crescent Apt. 086, West Coryport, GA...         HR
1         160 Williams Ridge, East Garrett, FL 61869         HR
2    50862 Chavez Burg Suite 488, Cruzbury, MA 65054  Marketing
3  96485 Brittany Roads Suite 604, Stacybury, SC ...  Marketing
4     497 Sabrina Club Suite 544, Tranberg, GU 03620  Marketing

   Years_at_Company  Annual_Salary  Satisfaction_Level  \
0             10.69       70448.68                4.79
1              7.32      107131.11                4.90
2             16.89      108398.00                4.20
3              8.15      132910.63                3.38
4             23.15       79724.66                1.68

   Last_Promotion_Years_Ago  Projects_Completed  Work_Hours_Per_Week  \
0                         3                  15                   48
1                         7                   9                   47
2                         7                  18                   58
3                         4                   8                   40
4                         1                   6                   23

   Remote_Work_Days_Per_Week Education_Level Performance_Rating
0                          4        Master's               Good
1                          0       Associate               Good
2                          0      Bachelor's      Below Average
3                          2             PhD      Below Average
4                          0      Bachelor's          Excellent

In [79]:
#read the data set form pyspark

employee_data = spark.createDataFrame(df)

employee_data.show()

+-----------+------------------+---+----------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|Employee_ID|              Name|Age|    Gender|               Email|             Address| Department|Years_at_Company|Annual_Salary|Satisfaction_Level|Last_Promotion_Years_Ago|Projects_Completed|Work_Hours_Per_Week|Remote_Work_Days_Per_Week|Education_Level|Performance_Rating|
+-----------+------------------+---+----------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|          1|     Brian Garrett| 35|      Male|montestammy@examp...|8977 Reid Crescen...|         HR|           10.69|     70448.68|              4.79|                       3|                15|                 48|                        4|       Master's|              Good|
|          2|      Isaac Walker| 48|    Female|crystalmolina@exa...|160 Williams Ridg...|         HR|            7.32|    107131.11|               4.9|                       7|                 9|                 47|                        0|      Associate|              Good|
|          3|  Kristin Friedman| 27|    Female|rachael41@example...|50862 Chavez Burg...|  Marketing|           16.89|     108398.0|               4.2|                       7|                18|                 58|                        0|     Bachelor's|     Below Average|
|          4|   Clinton Serrano| 24|    Female|  john42@example.net|96485 Brittany Ro...|  Marketing|            8.15|    132910.63|              3.38|                       4|                 8|                 40|                        2|            PhD|     Below Average|
|          5|   Tammy Armstrong| 35|    Female| qfuller@example.com|497 Sabrina Club ...|  Marketing|           23.15|     79724.66|              1.68|                       1|                 6|                 23|                        0|     Bachelor's|         Excellent|
|          6|   Taylor Ayala MD| 50|      Male|  vgomez@example.com|14349 Joseph Lane...|Engineering|           10.78|     63607.61|              7.27|                       9|                 8|                 54|                        4|    High School|     Below Average|
|          7|    Stacey Freeman| 55|    Female| ymurphy@example.com|3988 Christopher ...|    Finance|           28.02|    111763.39|              3.74|                      10|                13|                 41|                        5|       Master's|              Good|
|          8|         Erin Dunn| 57|    Female|kennethparker@exa...|64991 Mark Meadow...|Engineering|           13.92|    149556.87|              1.67|                       1|                18|                 35|                        1|     Bachelor's|     Below Average|
|          9|      Kayla Harvey| 63|Non-Binary|simselizabeth@exa...|19337 Gray Bridge...|         HR|            2.66|    108721.47|              3.63|                       8|                 3|                 50|                        5|     Bachelor's|     Below Average|
|         10|      Ronald Smith| 30|Non-Binary|dhumphrey@example...|6974 Megan Falls ...|  Marketing|           25.07|     107202.0|              3.06|                       9|                17|                 30|                        1|       Master's|              Good|
|         11|    Sally Trujillo| 28|      Male|rachel25@example.com|9417 Ramsey Prair...|         HR|            4.19|    114880.87|              0.55|                       2|                10|                 22|                        3|      Associate|              Good|
|         12|      Robert Brown| 53|Non-Binary|bonnie18@example.net|2708 Mark Coves, ...|Engineering|           19.19|     91437.37|              5.11|                       6|                 6|                 40|                        5|     Bachelor's|     Below Average|
|         13|Christopher Foster| 31|    Female|  htyler@example.org|86773 Joseph Ligh...|    Finance|           27.81|     75546.58|              2.93|                       1|                12|                 22|                        1|     Bachelor's|         Excellent|
|         14|     Tamara Farmer| 32|      Male|eramirez@example.org|721 Sarah Mission...|      Sales|           11.51|     65754.69|              8.24|                       0|                 2|                 26|                        3|     Bachelor's|     Below Average|
|         15|      Denise Ortiz| 32|Non-Binary|margaret07@exampl...|407 Barber Center...|    Finance|           19.65|    137333.95|              4.87|                       1|                17|                 48|                        3|    High School|         Excellent|
|         16|   Jordan Hall Jr.| 21|    Female| vdudley@example.org|USS Middleton, FP...|  Marketing|           21.77|    147638.16|              5.28|                       7|                 4|                 20|                        4|       Master's|              Good|
|         17|       David Myers| 30|      Male| ksparks@example.com|Unit 5231 Box 652...|  Marketing|           11.37|     59190.38|              1.78|                       5|                11|                 37|                        1|     Bachelor's|     Below Average|
|         18|  Rebecca Marshall| 33|Non-Binary|   breid@example.org|067 Jessica Vista...|Engineering|           24.97|     96658.36|              1.85|                      10|                20|                 40|                        0|      Associate|     Below Average|
|         19| Gregory Velazquez| 60|      Male|christopher80@exa...|PSC 3135, Box 937...|         HR|           24.52|     57325.78|              1.24|                       6|                 2|                 56|                        5|      Associate|           Average|
|         20|        Marc Jones| 48|    Female|  alan25@example.com|186 Moyer Skyway,...|    Finance|            29.4|    128631.28|              3.13|                       8|                17|                 35|                        3|      Associate|           Average|
+-----------+------------------+---+----------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
only showing top 20 rows

In [80]:
from ast import mod
#store the datset to localfile.
save_data = employee_data.coalesce(1).write.csv("/content/sample_data/employee_data.csv", mode="overwrite", header=True)

In [81]:
#read the datset from localfile and store it in data frame

df = spark.read.csv("/content/sample_data/employee_data.csv", header=True, inferSchema=True)
df.show()

+-----------+------------------+---+----------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|Employee_ID|              Name|Age|    Gender|               Email|             Address| Department|Years_at_Company|Annual_Salary|Satisfaction_Level|Last_Promotion_Years_Ago|Projects_Completed|Work_Hours_Per_Week|Remote_Work_Days_Per_Week|Education_Level|Performance_Rating|
+-----------+------------------+---+----------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|          1|     Brian Garrett| 35|      Male|montestammy@examp...|8977 Reid Crescen...|         HR|           10.69|     70448.68|              4.79|                       3|                15|                 48|                        4|       Master's|              Good|
|          2|      Isaac Walker| 48|    Female|crystalmolina@exa...|160 Williams Ridg...|         HR|            7.32|    107131.11|               4.9|                       7|                 9|                 47|                        0|      Associate|              Good|
|          3|  Kristin Friedman| 27|    Female|rachael41@example...|50862 Chavez Burg...|  Marketing|           16.89|     108398.0|               4.2|                       7|                18|                 58|                        0|     Bachelor's|     Below Average|
|          4|   Clinton Serrano| 24|    Female|  john42@example.net|96485 Brittany Ro...|  Marketing|            8.15|    132910.63|              3.38|                       4|                 8|                 40|                        2|            PhD|     Below Average|
|          5|   Tammy Armstrong| 35|    Female| qfuller@example.com|497 Sabrina Club ...|  Marketing|           23.15|     79724.66|              1.68|                       1|                 6|                 23|                        0|     Bachelor's|         Excellent|
|          6|   Taylor Ayala MD| 50|      Male|  vgomez@example.com|14349 Joseph Lane...|Engineering|           10.78|     63607.61|              7.27|                       9|                 8|                 54|                        4|    High School|     Below Average|
|          7|    Stacey Freeman| 55|    Female| ymurphy@example.com|3988 Christopher ...|    Finance|           28.02|    111763.39|              3.74|                      10|                13|                 41|                        5|       Master's|              Good|
|          8|         Erin Dunn| 57|    Female|kennethparker@exa...|64991 Mark Meadow...|Engineering|           13.92|    149556.87|              1.67|                       1|                18|                 35|                        1|     Bachelor's|     Below Average|
|          9|      Kayla Harvey| 63|Non-Binary|simselizabeth@exa...|19337 Gray Bridge...|         HR|            2.66|    108721.47|              3.63|                       8|                 3|                 50|                        5|     Bachelor's|     Below Average|
|         10|      Ronald Smith| 30|Non-Binary|dhumphrey@example...|6974 Megan Falls ...|  Marketing|           25.07|     107202.0|              3.06|                       9|                17|                 30|                        1|       Master's|              Good|
|         11|    Sally Trujillo| 28|      Male|rachel25@example.com|9417 Ramsey Prair...|         HR|            4.19|    114880.87|              0.55|                       2|                10|                 22|                        3|      Associate|              Good|
|         12|      Robert Brown| 53|Non-Binary|bonnie18@example.net|2708 Mark Coves, ...|Engineering|           19.19|     91437.37|              5.11|                       6|                 6|                 40|                        5|     Bachelor's|     Below Average|
|         13|Christopher Foster| 31|    Female|  htyler@example.org|86773 Joseph Ligh...|    Finance|           27.81|     75546.58|              2.93|                       1|                12|                 22|                        1|     Bachelor's|         Excellent|
|         14|     Tamara Farmer| 32|      Male|eramirez@example.org|721 Sarah Mission...|      Sales|           11.51|     65754.69|              8.24|                       0|                 2|                 26|                        3|     Bachelor's|     Below Average|
|         15|      Denise Ortiz| 32|Non-Binary|margaret07@exampl...|407 Barber Center...|    Finance|           19.65|    137333.95|              4.87|                       1|                17|                 48|                        3|    High School|         Excellent|
|         16|   Jordan Hall Jr.| 21|    Female| vdudley@example.org|USS Middleton, FP...|  Marketing|           21.77|    147638.16|              5.28|                       7|                 4|                 20|                        4|       Master's|              Good|
|         17|       David Myers| 30|      Male| ksparks@example.com|Unit 5231 Box 652...|  Marketing|           11.37|     59190.38|              1.78|                       5|                11|                 37|                        1|     Bachelor's|     Below Average|
|         18|  Rebecca Marshall| 33|Non-Binary|   breid@example.org|067 Jessica Vista...|Engineering|           24.97|     96658.36|              1.85|                      10|                20|                 40|                        0|      Associate|     Below Average|
|         19| Gregory Velazquez| 60|      Male|christopher80@exa...|PSC 3135, Box 937...|         HR|           24.52|     57325.78|              1.24|                       6|                 2|                 56|                        5|      Associate|           Average|
|         20|        Marc Jones| 48|    Female|  alan25@example.com|186 Moyer Skyway,...|    Finance|            29.4|    128631.28|              3.13|                       8|                17|                 35|                        3|      Associate|           Average|
+-----------+------------------+---+----------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
only showing top 20 rows

In [82]:
df.printSchema()

root
 |-- Employee_ID: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Email: string (nullable = true)
 |-- Address: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Years_at_Company: double (nullable = true)
 |-- Annual_Salary: double (nullable = true)
 |-- Satisfaction_Level: double (nullable = true)
 |-- Last_Promotion_Years_Ago: integer (nullable = true)
 |-- Projects_Completed: integer (nullable = true)
 |-- Work_Hours_Per_Week: integer (nullable = true)
 |-- Remote_Work_Days_Per_Week: integer (nullable = true)
 |-- Education_Level: string (nullable = true)
 |-- Performance_Rating: string (nullable = true)

In [83]:
df.first()

Row(Employee_ID=1, Name='Brian Garrett', Age=35, Gender='Male', Email='montestammy@example.net', Address='8977 Reid Crescent Apt. 086, West Coryport, GA 43877', Department='HR', Years_at_Company=10.69, Annual_Salary=70448.68, Satisfaction_Level=4.79, Last_Promotion_Years_Ago=3, Projects_Completed=15, Work_Hours_Per_Week=48, Remote_Work_Days_Per_Week=4, Education_Level="Master's", Performance_Rating='Good')

In [84]:
df.count()

5000

In [85]:
# Get the number of columns in the DataFrame
num_columns = len(df.columns)

# You can then print or use the num_columns variable
print(num_columns)

16

In [86]:
# Use the logical AND operator (&) with parentheses around each condition
df.select("Name", "Age").filter((df["Age"] > 30) & (df["Age"] < 35)).count()

396

In [87]:
#select

df.select("Name", "Age").show()

+------------------+---+
|              Name|Age|
+------------------+---+
|     Brian Garrett| 35|
|      Isaac Walker| 48|
|  Kristin Friedman| 27|
|   Clinton Serrano| 24|
|   Tammy Armstrong| 35|
|   Taylor Ayala MD| 50|
|    Stacey Freeman| 55|
|         Erin Dunn| 57|
|      Kayla Harvey| 63|
|      Ronald Smith| 30|
|    Sally Trujillo| 28|
|      Robert Brown| 53|
|Christopher Foster| 31|
|     Tamara Farmer| 32|
|      Denise Ortiz| 32|
|   Jordan Hall Jr.| 21|
|       David Myers| 30|
|  Rebecca Marshall| 33|
| Gregory Velazquez| 60|
|        Marc Jones| 48|
+------------------+---+
only showing top 20 rows

In [88]:
#where
df.where(df["Age"] > 30).show()

+-----------+------------------+---+----------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|Employee_ID|              Name|Age|    Gender|               Email|             Address| Department|Years_at_Company|Annual_Salary|Satisfaction_Level|Last_Promotion_Years_Ago|Projects_Completed|Work_Hours_Per_Week|Remote_Work_Days_Per_Week|Education_Level|Performance_Rating|
+-----------+------------------+---+----------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|          1|     Brian Garrett| 35|      Male|montestammy@examp...|8977 Reid Crescen...|         HR|           10.69|     70448.68|              4.79|                       3|                15|                 48|                        4|       Master's|              Good|
|          2|      Isaac Walker| 48|    Female|crystalmolina@exa...|160 Williams Ridg...|         HR|            7.32|    107131.11|               4.9|                       7|                 9|                 47|                        0|      Associate|              Good|
|          5|   Tammy Armstrong| 35|    Female| qfuller@example.com|497 Sabrina Club ...|  Marketing|           23.15|     79724.66|              1.68|                       1|                 6|                 23|                        0|     Bachelor's|         Excellent|
|          6|   Taylor Ayala MD| 50|      Male|  vgomez@example.com|14349 Joseph Lane...|Engineering|           10.78|     63607.61|              7.27|                       9|                 8|                 54|                        4|    High School|     Below Average|
|          7|    Stacey Freeman| 55|    Female| ymurphy@example.com|3988 Christopher ...|    Finance|           28.02|    111763.39|              3.74|                      10|                13|                 41|                        5|       Master's|              Good|
|          8|         Erin Dunn| 57|    Female|kennethparker@exa...|64991 Mark Meadow...|Engineering|           13.92|    149556.87|              1.67|                       1|                18|                 35|                        1|     Bachelor's|     Below Average|
|          9|      Kayla Harvey| 63|Non-Binary|simselizabeth@exa...|19337 Gray Bridge...|         HR|            2.66|    108721.47|              3.63|                       8|                 3|                 50|                        5|     Bachelor's|     Below Average|
|         12|      Robert Brown| 53|Non-Binary|bonnie18@example.net|2708 Mark Coves, ...|Engineering|           19.19|     91437.37|              5.11|                       6|                 6|                 40|                        5|     Bachelor's|     Below Average|
|         13|Christopher Foster| 31|    Female|  htyler@example.org|86773 Joseph Ligh...|    Finance|           27.81|     75546.58|              2.93|                       1|                12|                 22|                        1|     Bachelor's|         Excellent|
|         14|     Tamara Farmer| 32|      Male|eramirez@example.org|721 Sarah Mission...|      Sales|           11.51|     65754.69|              8.24|                       0|                 2|                 26|                        3|     Bachelor's|     Below Average|
|         15|      Denise Ortiz| 32|Non-Binary|margaret07@exampl...|407 Barber Center...|    Finance|           19.65|    137333.95|              4.87|                       1|                17|                 48|                        3|    High School|         Excellent|
|         18|  Rebecca Marshall| 33|Non-Binary|   breid@example.org|067 Jessica Vista...|Engineering|           24.97|     96658.36|              1.85|                      10|                20|                 40|                        0|      Associate|     Below Average|
|         19| Gregory Velazquez| 60|      Male|christopher80@exa...|PSC 3135, Box 937...|         HR|           24.52|     57325.78|              1.24|                       6|                 2|                 56|                        5|      Associate|           Average|
|         20|        Marc Jones| 48|    Female|  alan25@example.com|186 Moyer Skyway,...|    Finance|            29.4|    128631.28|              3.13|                       8|                17|                 35|                        3|      Associate|           Average|
|         23|    Joshua Gardner| 61|Non-Binary|bishopmichael@exa...|486 Michael Coves...|      Sales|           22.34|     54639.18|              3.63|                       4|                 8|                 60|                        3|       Master's|         Excellent|
|         24|    Anthony Wilcox| 39|      Male|manningjane@examp...|4342 Kristi Viadu...|      Sales|           29.56|     53355.37|              0.46|                      10|                12|                 47|                        2|       Master's|           Average|
|         25|    Antonio Bryant| 37|    Female|  carl79@example.net|9307 Henderson Vi...|  Marketing|            9.23|     65250.82|              7.52|                       9|                12|                 48|                        5|     Bachelor's|         Excellent|
|         27| Stephen Contreras| 34|      Male|mwilliams@example...|66695 Courtney La...|    Finance|            4.34|     99179.48|              9.34|                       8|                20|                 39|                        4|       Master's|              Good|
|         28|      Erica Holmes| 52|      Male|hebertmichael@exa...|9067 Williams Isl...|         HR|           18.86|    103171.47|              2.27|                       8|                 5|                 52|                        0|      Associate|         Excellent|
|         29|  Jessica Williams| 40|Non-Binary|watkinsjamie@exam...|460 Jeffrey Radia...|  Marketing|           29.08|    123483.81|              1.44|                       3|                 1|                 39|                        5|    High School|           Average|
+-----------+------------------+---+----------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
only showing top 20 rows

In [89]:
#filter
df.filter(df["Gender"] == 'Male' ).show()
df.filter((df["Gender"] == 'Female') & (df['Age']==30)).show()

+-----------+-----------------+---+------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|Employee_ID|             Name|Age|Gender|               Email|             Address| Department|Years_at_Company|Annual_Salary|Satisfaction_Level|Last_Promotion_Years_Ago|Projects_Completed|Work_Hours_Per_Week|Remote_Work_Days_Per_Week|Education_Level|Performance_Rating|
+-----------+-----------------+---+------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|          1|    Brian Garrett| 35|  Male|montestammy@examp...|8977 Reid Crescen...|         HR|           10.69|     70448.68|              4.79|                       3|                15|                 48|                        4|       Master's|              Good|
|          6|  Taylor Ayala MD| 50|  Male|  vgomez@example.com|14349 Joseph Lane...|Engineering|           10.78|     63607.61|              7.27|                       9|                 8|                 54|                        4|    High School|     Below Average|
|         11|   Sally Trujillo| 28|  Male|rachel25@example.com|9417 Ramsey Prair...|         HR|            4.19|    114880.87|              0.55|                       2|                10|                 22|                        3|      Associate|              Good|
|         14|    Tamara Farmer| 32|  Male|eramirez@example.org|721 Sarah Mission...|      Sales|           11.51|     65754.69|              8.24|                       0|                 2|                 26|                        3|     Bachelor's|     Below Average|
|         17|      David Myers| 30|  Male| ksparks@example.com|Unit 5231 Box 652...|  Marketing|           11.37|     59190.38|              1.78|                       5|                11|                 37|                        1|     Bachelor's|     Below Average|
|         19|Gregory Velazquez| 60|  Male|christopher80@exa...|PSC 3135, Box 937...|         HR|           24.52|     57325.78|              1.24|                       6|                 2|                 56|                        5|      Associate|           Average|
|         24|   Anthony Wilcox| 39|  Male|manningjane@examp...|4342 Kristi Viadu...|      Sales|           29.56|     53355.37|              0.46|                      10|                12|                 47|                        2|       Master's|           Average|
|         26|Brandon Hendricks| 27|  Male|rnichols@example.net|7944 Kelly River ...|         HR|           26.54|    147479.39|               0.7|                       6|                 3|                 53|                        3|            PhD|         Excellent|
|         27|Stephen Contreras| 34|  Male|mwilliams@example...|66695 Courtney La...|    Finance|            4.34|     99179.48|              9.34|                       8|                20|                 39|                        4|       Master's|              Good|
|         28|     Erica Holmes| 52|  Male|hebertmichael@exa...|9067 Williams Isl...|         HR|           18.86|    103171.47|              2.27|                       8|                 5|                 52|                        0|      Associate|         Excellent|
|         31|      Stacy Price| 43|  Male|michael99@example...|77192 Charles Fal...|Engineering|            0.43|     80875.19|              3.45|                       1|                 4|                 27|                        3|       Master's|              Good|
|         33|   Annette Holmes| 55|  Male| ihughes@example.com|789 Tiffany Isle ...|  Marketing|           17.08|    103362.19|              8.73|                       8|                 7|                 32|                        3|       Master's|     Below Average|
|         49|         Gina Cox| 35|  Male| brady74@example.com|1054 Alison Cente...|Engineering|           13.86|    146237.71|              3.46|                       0|                13|                 60|                        5|       Master's|         Excellent|
|         52| Alexander Turner| 23|  Male|cmerritt@example.com|54905 Melinda Pik...|         HR|           18.67|     50786.08|              1.71|                       4|                14|                 39|                        4|      Associate|     Below Average|
|         53|    Kylie Manning| 55|  Male| awright@example.org|4909 Moore Pines,...|Engineering|           11.38|    139081.42|               6.4|                       2|                19|                 39|                        5|       Master's|           Average|
|         55|   Jessica Wilson| 44|  Male|dfreeman@example.net|4522 Harris Glen ...|  Marketing|            5.02|      54319.9|              9.38|                       5|                 7|                 38|                        0|     Bachelor's|         Excellent|
|         56|     Robert Smith| 59|  Male|emilysalinas@exam...|24024 Steven Isla...|         HR|            3.42|     77930.73|              5.96|                       2|                 9|                 21|                        1|      Associate|           Average|
|         60|     Karen Powell| 56|  Male|changstephen@exam...|17080 Angela Exte...|  Marketing|           20.93|     94107.77|              8.38|                       0|                18|                 59|                        5|     Bachelor's|     Below Average|
|         62|    Angela Lawson| 20|  Male|  rstone@example.com|044 Christine Poi...|Engineering|            9.77|    131545.36|              4.06|                      10|                 7|                 48|                        2|       Master's|              Good|
|         65|    Beverly Brown| 56|  Male|barnettcarl@examp...|733 King Mount, J...|    Finance|           24.68|    130149.48|               5.5|                       6|                13|                 50|                        3|     Bachelor's|         Excellent|
+-----------+-----------------+---+------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
only showing top 20 rows

+-----------+-----------------+---+------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|Employee_ID|             Name|Age|Gender|               Email|             Address| Department|Years_at_Company|Annual_Salary|Satisfaction_Level|Last_Promotion_Years_Ago|Projects_Completed|Work_Hours_Per_Week|Remote_Work_Days_Per_Week|Education_Level|Performance_Rating|
+-----------+-----------------+---+------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|         21|       Ryan Grant| 30|Female|miguelschneider@e...|081 Elizabeth Mou...|         HR|           13.73|    114081.59|              0.86|                      10|                 5|                 26|                        2|       Master's|     Below Average|
|        102|    Caitlin Olson| 30|Female|wardchristopher@e...|310 Walter Dam Ap...|         HR|           19.97|     62168.51|              8.23|                       5|                 4|                 22|                        2|      Associate|         Excellent|
|        105|Tiffany Rodriguez| 30|Female|caitlin22@example...|USCGC Williamson,...|      Sales|           26.39|    112334.44|              9.87|                       5|                 5|                 41|                        4|    High School|           Average|
|        269|      Rachel Tran| 30|Female|  mary81@example.org|44700 Grant Strea...|  Marketing|           13.25|      94914.2|              0.66|                       8|                16|                 54|                        2|       Master's|         Excellent|
|        359|       Mary Moore| 30|Female|zflowers@example.com|74361 Dunn Island...|      Sales|            5.16|    110129.94|              8.15|                       2|                 6|                 53|                        5|     Bachelor's|              Good|
|        524|        Kyle Chan| 30|Female|derrick94@example...|1718 Smith Plains...|  Marketing|           10.68|     71160.51|              4.12|                       7|                 5|                 57|                        4|            PhD|              Good|
|        628|     Hailey Brown| 30|Female|jamesweaver@examp...|29995 Irwin Valle...|         HR|            1.92|    139963.86|              5.59|                       8|                 0|                 46|                        3|     Bachelor's|     Below Average|
|        667|      Maria Brown| 30|Female|christopherrobins...|96681 Myers Harbo...|    Finance|            0.04|    107197.81|              4.02|                       7|                11|                 21|                        4|       Master's|           Average|
|        677|   Deanna Vazquez| 30|Female|michael49@example...|570 Jennifer Row ...|    Finance|            0.33|     60421.47|              4.79|                       0|                 6|                 51|                        2|      Associate|     Below Average|
|       1064|    Nicole Fisher| 30|Female|  vlewis@example.org|2980 Sabrina Esta...|      Sales|           28.69|     77272.11|              7.38|                       7|                16|                 35|                        0|            PhD|              Good|
|       1390|    Shannon Moran| 30|Female|crawfordjoseph@ex...|394 Michael Summi...|    Finance|           20.18|      68997.5|              1.95|                      10|                 2|                 26|                        1|     Bachelor's|           Average|
|       1441|Benjamin Mcdonald| 30|Female|mariareyes@exampl...|90797 Washington ...|    Finance|            21.2|     85603.62|              6.63|                       8|                 6|                 27|                        4|            PhD|           Average|
|       1450| Brittany Walters| 30|Female| atucker@example.net|5294 Brown Grove ...|      Sales|           18.73|     71857.73|              4.65|                       0|                 9|                 48|                        5|     Bachelor's|           Average|
|       2005| Cassandra Martin| 30|Female|  lisa65@example.com|771 Tate Ridge, P...|      Sales|           27.05|     68556.18|              2.88|                      10|                 7|                 23|                        3|     Bachelor's|     Below Average|
|       2198|     Kathy Harris| 30|Female|tristangreer@exam...|89323 Berry Circl...|Engineering|           29.01|     67857.66|              0.99|                       8|                 7|                 20|                        0|      Associate|         Excellent|
|       2248|       Janet Shaw| 30|Female| amber92@example.net|64655 Lauren Pass...|Engineering|            0.65|    111416.74|              1.92|                       4|                 7|                 48|                        0|      Associate|           Average|
|       2412|   Angela Johnson| 30|Female|mcintoshdarryl@ex...|USNS Heath, FPO A...|    Finance|            7.63|    112518.26|              4.63|                      10|                15|                 52|                        3|     Bachelor's|         Excellent|
|       2415|  Joseph Shepherd| 30|Female|daviesanthony@exa...|909 Jessica Plain...|      Sales|            1.43|    148416.93|              6.12|                       5|                 9|                 35|                        5|     Bachelor's|           Average|
|       2465|      Jared Yoder| 30|Female|gherrera@example.net|10587 Andrew Driv...|  Marketing|           29.87|    148498.42|              0.72|                       7|                 7|                 46|                        3|    High School|           Average|
|       2638|     Jack Jimenez| 30|Female|williamsmith@exam...|USNV Johnson, FPO...|    Finance|           21.08|    135516.63|              9.12|                       3|                14|                 20|                        2|      Associate|     Below Average|
+-----------+-----------------+---+------+--------------------+--------------------+-----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
only showing top 20 rows

In [90]:
df.where("Department == 'HR' AND age == 30").show()

+-----------+-------------------+---+----------+--------------------+--------------------+----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|Employee_ID|               Name|Age|    Gender|               Email|             Address|Department|Years_at_Company|Annual_Salary|Satisfaction_Level|Last_Promotion_Years_Ago|Projects_Completed|Work_Hours_Per_Week|Remote_Work_Days_Per_Week|Education_Level|Performance_Rating|
+-----------+-------------------+---+----------+--------------------+--------------------+----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+
|         21|         Ryan Grant| 30|    Female|miguelschneider@e...|081 Elizabeth Mou...|        HR|           13.73|    114081.59|              0.86|                      10|                 5|                 26|                        2|       Master's|     Below Average|
|         37|       James Tucker| 30|Non-Binary|morgancasey@examp...|842 White Drives,...|        HR|           10.48|    117290.36|              3.09|                       7|                 4|                 47|                        5|      Associate|              Good|
|        102|      Caitlin Olson| 30|    Female|wardchristopher@e...|310 Walter Dam Ap...|        HR|           19.97|     62168.51|              8.23|                       5|                 4|                 22|                        2|      Associate|         Excellent|
|        366|      Michael Henry| 30|      Male|nancyadams@exampl...|USNV Marshall, FP...|        HR|           12.14|    109273.77|              5.41|                       2|                 6|                 48|                        3|            PhD|         Excellent|
|        457|        Maria Burns| 30|      Male| pnguyen@example.com|4422 Ward Roads A...|        HR|            0.04|    105502.16|              5.01|                       4|                20|                 52|                        5|    High School|              Good|
|        531|         Erin Ramos| 30|Non-Binary|yvonne31@example.net|457 Nelson Mounta...|        HR|            9.49|      98353.3|              6.62|                       4|                19|                 30|                        3|      Associate|     Below Average|
|        628|       Hailey Brown| 30|    Female|jamesweaver@examp...|29995 Irwin Valle...|        HR|            1.92|    139963.86|              5.59|                       8|                 0|                 46|                        3|     Bachelor's|     Below Average|
|       1193|       Sean Jackson| 30|      Male|olsenkevin@exampl...|89504 Tyler Throu...|        HR|           11.57|    102514.28|              2.48|                       6|                10|                 27|                        3|       Master's|         Excellent|
|       1606|    Jeremy Williams| 30|      Male|  msmith@example.net|70930 Saunders Ci...|        HR|            1.41|    100935.57|              2.11|                       4|                 7|                 37|                        3|      Associate|           Average|
|       2853|         John Olsen| 30|Non-Binary|mallory38@example...|37249 Shannon Sta...|        HR|           13.16|     91074.91|              2.74|                       7|                10|                 54|                        2|     Bachelor's|           Average|
|       2868|Christopher Simpson| 30|      Male|tiffanyallen@exam...|4516 Clark Ports,...|        HR|            1.92|     80714.69|              5.35|                       1|                20|                 50|                        4|       Master's|     Below Average|
|       3046|     Jessica Harris| 30|      Male|christopher76@exa...|01244 Chavez Broo...|        HR|            0.24|    144204.34|              2.06|                       3|                14|                 34|                        4|     Bachelor's|         Excellent|
|       3154|    Alyssa Jones MD| 30|Non-Binary|connor79@example.org|93933 Billy Circl...|        HR|           22.92|    124016.92|              3.17|                       5|                 7|                 29|                        5|       Master's|              Good|
|       3294|     Marcus Edwards| 30|    Female| lpowers@example.com|33393 Paula Manor...|        HR|            2.36|     69994.25|              0.29|                       4|                 8|                 35|                        4|     Bachelor's|              Good|
|       3816|         Mary Ramos| 30|    Female| skeller@example.net|7751 Garcia Sprin...|        HR|            17.4|    106157.65|              9.63|                       9|                14|                 24|                        2|      Associate|              Good|
|       4039|     Mr. Jesus King| 30|      Male|kimberly68@exampl...|68466 Ebony Path,...|        HR|           23.74|     97689.16|              4.63|                       2|                 2|                 47|                        4|            PhD|         Excellent|
|       4129|      Ashley Archer| 30|    Female|clarkjennifer@exa...|1874 Gabriel Terr...|        HR|           11.32|     59067.85|              4.54|                      10|                 9|                 32|                        1|      Associate|              Good|
|       4537|   Katherine Glover| 30|Non-Binary|  vcolon@example.net|09774 Walker Mall...|        HR|           12.34|    124861.42|              6.59|                       4|                14|                 30|                        2|     Bachelor's|           Average|
+-----------+-------------------+---+----------+--------------------+--------------------+----------+----------------+-------------+------------------+------------------------+------------------+-------------------+-------------------------+---------------+------------------+

WITH COLOUMN

In [91]:
employee_data = [
    ("Alice", 25, "Engineering", 60000),
    ("Bob", 30, "Sales", 70000),
    ("Charlie", 22, "Marketing", 55000),
    ("David", 35, "Engineering", 75000),
    ("Eve", 28, "Sales", 65000),
    ("Frank", 40, "Human Resources", 80000),
    ("Grace", 23, "Marketing", 58000),
    ("Heidi", 31, "Engineering", 72000),
    ("Ivan", 27, "Sales", 68000),
    ("Judy", 29, "Human Resources", 78000),
    ("Kevin", 26, "Engineering", 62000),
    ("Liam", 33, "Marketing", 60000),
    ("Mia", 24, "Sales", 63000),
    ("Noah", 38, "Engineering", 85000),
    ("Olivia", 32, "Human Resources", 82000),
    ("Peter", 21, "Marketing", 52000),
    ("Quinn", 36, "Sales", 72000),
    ("Riley", 29, "Engineering", 70000),
    ("Sophia", 27, "Human Resources", 75000),
    ("Thomas", 34, "Marketing", 65000)
]

employee_table = ["Name", "Age", "Department", "Salary"]

#create dataframe
df = spark.createDataFrame(employee_data, employee_table)
df.show()

+-------+---+---------------+------+
|   Name|Age|     Department|Salary|
+-------+---+---------------+------+
|  Alice| 25|    Engineering| 60000|
|    Bob| 30|          Sales| 70000|
|Charlie| 22|      Marketing| 55000|
|  David| 35|    Engineering| 75000|
|    Eve| 28|          Sales| 65000|
|  Frank| 40|Human Resources| 80000|
|  Grace| 23|      Marketing| 58000|
|  Heidi| 31|    Engineering| 72000|
|   Ivan| 27|          Sales| 68000|
|   Judy| 29|Human Resources| 78000|
|  Kevin| 26|    Engineering| 62000|
|   Liam| 33|      Marketing| 60000|
|    Mia| 24|          Sales| 63000|
|   Noah| 38|    Engineering| 85000|
| Olivia| 32|Human Resources| 82000|
|  Peter| 21|      Marketing| 52000|
|  Quinn| 36|          Sales| 72000|
|  Riley| 29|    Engineering| 70000|
| Sophia| 27|Human Resources| 75000|
| Thomas| 34|      Marketing| 65000|
+-------+---+---------------+------+

In [92]:
#add newcoloumn using withcoloum
with_df = df.withColumn("Salary_increment", df["Salary"] * 1.05)
with_df.show()

+-------+---+---------------+------+----------------+
|   Name|Age|     Department|Salary|Salary_increment|
+-------+---+---------------+------+----------------+
|  Alice| 25|    Engineering| 60000|         63000.0|
|    Bob| 30|          Sales| 70000|         73500.0|
|Charlie| 22|      Marketing| 55000|         57750.0|
|  David| 35|    Engineering| 75000|         78750.0|
|    Eve| 28|          Sales| 65000|         68250.0|
|  Frank| 40|Human Resources| 80000|         84000.0|
|  Grace| 23|      Marketing| 58000|         60900.0|
|  Heidi| 31|    Engineering| 72000|         75600.0|
|   Ivan| 27|          Sales| 68000|         71400.0|
|   Judy| 29|Human Resources| 78000|         81900.0|
|  Kevin| 26|    Engineering| 62000|         65100.0|
|   Liam| 33|      Marketing| 60000|         63000.0|
|    Mia| 24|          Sales| 63000|         66150.0|
|   Noah| 38|    Engineering| 85000|         89250.0|
| Olivia| 32|Human Resources| 82000|         86100.0|
|  Peter| 21|      Marketing| 52000|         54600.0|
|  Quinn| 36|          Sales| 72000|         75600.0|
|  Riley| 29|    Engineering| 70000|         73500.0|
| Sophia| 27|Human Resources| 75000|         78750.0|
| Thomas| 34|      Marketing| 65000|         68250.0|
+-------+---+---------------+------+----------------+

In [93]:
#change a new value to the exesting coloumn
df.withColumn("Age", df["Age"] + 1).show() #compare with above table

+-------+---+---------------+------+
|   Name|Age|     Department|Salary|
+-------+---+---------------+------+
|  Alice| 26|    Engineering| 60000|
|    Bob| 31|          Sales| 70000|
|Charlie| 23|      Marketing| 55000|
|  David| 36|    Engineering| 75000|
|    Eve| 29|          Sales| 65000|
|  Frank| 41|Human Resources| 80000|
|  Grace| 24|      Marketing| 58000|
|  Heidi| 32|    Engineering| 72000|
|   Ivan| 28|          Sales| 68000|
|   Judy| 30|Human Resources| 78000|
|  Kevin| 27|    Engineering| 62000|
|   Liam| 34|      Marketing| 60000|
|    Mia| 25|          Sales| 63000|
|   Noah| 39|    Engineering| 85000|
| Olivia| 33|Human Resources| 82000|
|  Peter| 22|      Marketing| 52000|
|  Quinn| 37|          Sales| 72000|
|  Riley| 30|    Engineering| 70000|
| Sophia| 28|Human Resources| 75000|
| Thomas| 35|      Marketing| 65000|
+-------+---+---------------+------+

In [94]:
#using lit

from pyspark.sql.functions import lit

df.withColumn("Country", lit("IND")).show()

+-------+---+---------------+------+-------+
|   Name|Age|     Department|Salary|Country|
+-------+---+---------------+------+-------+
|  Alice| 25|    Engineering| 60000|    IND|
|    Bob| 30|          Sales| 70000|    IND|
|Charlie| 22|      Marketing| 55000|    IND|
|  David| 35|    Engineering| 75000|    IND|
|    Eve| 28|          Sales| 65000|    IND|
|  Frank| 40|Human Resources| 80000|    IND|
|  Grace| 23|      Marketing| 58000|    IND|
|  Heidi| 31|    Engineering| 72000|    IND|
|   Ivan| 27|          Sales| 68000|    IND|
|   Judy| 29|Human Resources| 78000|    IND|
|  Kevin| 26|    Engineering| 62000|    IND|
|   Liam| 33|      Marketing| 60000|    IND|
|    Mia| 24|          Sales| 63000|    IND|
|   Noah| 38|    Engineering| 85000|    IND|
| Olivia| 32|Human Resources| 82000|    IND|
|  Peter| 21|      Marketing| 52000|    IND|
|  Quinn| 36|          Sales| 72000|    IND|
|  Riley| 29|    Engineering| 70000|    IND|
| Sophia| 27|Human Resources| 75000|    IND|
| Thomas| 34|      Marketing| 65000|    IND|
+-------+---+---------------+------+-------+

In [95]:
from pyspark.sql.functions import when, lit

# Assuming 'df' is your DataFrame with a column named 'Age'
# Add a new column 'Age_Category' based on the 'Age' column
df_with_category = df.withColumn(
    "Age_Category",
    when(df["Age"] > 30, lit("Older than 30"))
    .otherwise(lit("30 or younger"))
)

df_with_category.show()

df_with_city = df.withColumn(
    "City",
    when (df["Age"] > 30, lit("Banglore"))
    .otherwise(lit("Delhi"))
)


df_with_city.show()

+-------+---+---------------+------+-------------+
|   Name|Age|     Department|Salary| Age_Category|
+-------+---+---------------+------+-------------+
|  Alice| 25|    Engineering| 60000|30 or younger|
|    Bob| 30|          Sales| 70000|30 or younger|
|Charlie| 22|      Marketing| 55000|30 or younger|
|  David| 35|    Engineering| 75000|Older than 30|
|    Eve| 28|          Sales| 65000|30 or younger|
|  Frank| 40|Human Resources| 80000|Older than 30|
|  Grace| 23|      Marketing| 58000|30 or younger|
|  Heidi| 31|    Engineering| 72000|Older than 30|
|   Ivan| 27|          Sales| 68000|30 or younger|
|   Judy| 29|Human Resources| 78000|30 or younger|
|  Kevin| 26|    Engineering| 62000|30 or younger|
|   Liam| 33|      Marketing| 60000|Older than 30|
|    Mia| 24|          Sales| 63000|30 or younger|
|   Noah| 38|    Engineering| 85000|Older than 30|
| Olivia| 32|Human Resources| 82000|Older than 30|
|  Peter| 21|      Marketing| 52000|30 or younger|
|  Quinn| 36|          Sales| 72000|Older than 30|
|  Riley| 29|    Engineering| 70000|30 or younger|
| Sophia| 27|Human Resources| 75000|30 or younger|
| Thomas| 34|      Marketing| 65000|Older than 30|
+-------+---+---------------+------+-------------+

+-------+---+---------------+------+--------+
|   Name|Age|     Department|Salary|    City|
+-------+---+---------------+------+--------+
|  Alice| 25|    Engineering| 60000|   Delhi|
|    Bob| 30|          Sales| 70000|   Delhi|
|Charlie| 22|      Marketing| 55000|   Delhi|
|  David| 35|    Engineering| 75000|Banglore|
|    Eve| 28|          Sales| 65000|   Delhi|
|  Frank| 40|Human Resources| 80000|Banglore|
|  Grace| 23|      Marketing| 58000|   Delhi|
|  Heidi| 31|    Engineering| 72000|Banglore|
|   Ivan| 27|          Sales| 68000|   Delhi|
|   Judy| 29|Human Resources| 78000|   Delhi|
|  Kevin| 26|    Engineering| 62000|   Delhi|
|   Liam| 33|      Marketing| 60000|Banglore|
|    Mia| 24|          Sales| 63000|   Delhi|
|   Noah| 38|    Engineering| 85000|Banglore|
| Olivia| 32|Human Resources| 82000|Banglore|
|  Peter| 21|      Marketing| 52000|   Delhi|
|  Quinn| 36|          Sales| 72000|Banglore|
|  Riley| 29|    Engineering| 70000|   Delhi|
| Sophia| 27|Human Resources| 75000|   Delhi|
| Thomas| 34|      Marketing| 65000|Banglore|
+-------+---+---------------+------+--------+

In [96]:
#new coloum from existing coloumn
df.withColumn("Salary_increment", df["Salary"] * 1.05).show()

+-------+---+---------------+------+----------------+
|   Name|Age|     Department|Salary|Salary_increment|
+-------+---+---------------+------+----------------+
|  Alice| 25|    Engineering| 60000|         63000.0|
|    Bob| 30|          Sales| 70000|         73500.0|
|Charlie| 22|      Marketing| 55000|         57750.0|
|  David| 35|    Engineering| 75000|         78750.0|
|    Eve| 28|          Sales| 65000|         68250.0|
|  Frank| 40|Human Resources| 80000|         84000.0|
|  Grace| 23|      Marketing| 58000|         60900.0|
|  Heidi| 31|    Engineering| 72000|         75600.0|
|   Ivan| 27|          Sales| 68000|         71400.0|
|   Judy| 29|Human Resources| 78000|         81900.0|
|  Kevin| 26|    Engineering| 62000|         65100.0|
|   Liam| 33|      Marketing| 60000|         63000.0|
|    Mia| 24|          Sales| 63000|         66150.0|
|   Noah| 38|    Engineering| 85000|         89250.0|
| Olivia| 32|Human Resources| 82000|         86100.0|
|  Peter| 21|      Marketing| 52000|         54600.0|
|  Quinn| 36|          Sales| 72000|         75600.0|
|  Riley| 29|    Engineering| 70000|         73500.0|
| Sophia| 27|Human Resources| 75000|         78750.0|
| Thomas| 34|      Marketing| 65000|         68250.0|
+-------+---+---------------+------+----------------+

In [97]:
#change coloumn data type
df.printSchema() #salary is long
df.withColumn("Salary", df["Salary"].cast("int")).printSchema()#sal is int

root
 |-- Name: string (nullable = true)
 |-- Age: long (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: long (nullable = true)

root
 |-- Name: string (nullable = true)
 |-- Age: long (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: integer (nullable = true)

In [98]:
df.withColumnRenamed("Name", "Employee_Name").show()

+-------------+---+---------------+------+
|Employee_Name|Age|     Department|Salary|
+-------------+---+---------------+------+
|        Alice| 25|    Engineering| 60000|
|          Bob| 30|          Sales| 70000|
|      Charlie| 22|      Marketing| 55000|
|        David| 35|    Engineering| 75000|
|          Eve| 28|          Sales| 65000|
|        Frank| 40|Human Resources| 80000|
|        Grace| 23|      Marketing| 58000|
|        Heidi| 31|    Engineering| 72000|
|         Ivan| 27|          Sales| 68000|
|         Judy| 29|Human Resources| 78000|
|        Kevin| 26|    Engineering| 62000|
|         Liam| 33|      Marketing| 60000|
|          Mia| 24|          Sales| 63000|
|         Noah| 38|    Engineering| 85000|
|       Olivia| 32|Human Resources| 82000|
|        Peter| 21|      Marketing| 52000|
|        Quinn| 36|          Sales| 72000|
|        Riley| 29|    Engineering| 70000|
|       Sophia| 27|Human Resources| 75000|
|       Thomas| 34|      Marketing| 65000|
+-------------+---+---------------+------+

In [99]:
#drop coloumn
df.drop("Age").show()

+-------+---------------+------+
|   Name|     Department|Salary|
+-------+---------------+------+
|  Alice|    Engineering| 60000|
|    Bob|          Sales| 70000|
|Charlie|      Marketing| 55000|
|  David|    Engineering| 75000|
|    Eve|          Sales| 65000|
|  Frank|Human Resources| 80000|
|  Grace|      Marketing| 58000|
|  Heidi|    Engineering| 72000|
|   Ivan|          Sales| 68000|
|   Judy|Human Resources| 78000|
|  Kevin|    Engineering| 62000|
|   Liam|      Marketing| 60000|
|    Mia|          Sales| 63000|
|   Noah|    Engineering| 85000|
| Olivia|Human Resources| 82000|
|  Peter|      Marketing| 52000|
|  Quinn|          Sales| 72000|
|  Riley|    Engineering| 70000|
| Sophia|Human Resources| 75000|
| Thomas|      Marketing| 65000|
+-------+---------------+------+

In [100]:
"""
🔧 Function: split()

✅ Purpose:
Splits a string column into an array of substrings, which can then be extracted using indexing.

🧪 Syntax:
split(str_col, pattern)
"""
from pyspark.sql import SparkSession
from pyspark.sql.functions import split

# Initialize Spark session
spark = SparkSession.builder.appName("SplitColumnExample").getOrCreate()

# Sample data
data = [("Alice Smith",), ("Bob Johnson",), ("John Doe",), ("Jane Smith",), ("Peter Jones",), ("Mary Williams",), ("David Brown",)]
df1 = spark.createDataFrame(data, ["full_name"])

# Split 'full_name' into two columns: 'first_name' and 'last_name'
df_split = df1.withColumn("first_name", split(df1["full_name"], " ").getItem(0)) \
             .withColumn("last_name", split(df1["full_name"], " ").getItem(1))

df_split.show()

+-------------+----------+---------+
|    full_name|first_name|last_name|
+-------------+----------+---------+
|  Alice Smith|     Alice|    Smith|
|  Bob Johnson|       Bob|  Johnson|
|     John Doe|      John|      Doe|
|   Jane Smith|      Jane|    Smith|
|  Peter Jones|     Peter|    Jones|
|Mary Williams|      Mary| Williams|
|  David Brown|     David|    Brown|
+-------------+----------+---------+

In [101]:
#rename multiplecloumns
df.withColumnRenamed("Name", "Employee_Name").withColumnRenamed("Age", "Employee_Age").show()

+-------------+------------+---------------+------+
|Employee_Name|Employee_Age|     Department|Salary|
+-------------+------------+---------------+------+
|        Alice|          25|    Engineering| 60000|
|          Bob|          30|          Sales| 70000|
|      Charlie|          22|      Marketing| 55000|
|        David|          35|    Engineering| 75000|
|          Eve|          28|          Sales| 65000|
|        Frank|          40|Human Resources| 80000|
|        Grace|          23|      Marketing| 58000|
|        Heidi|          31|    Engineering| 72000|
|         Ivan|          27|          Sales| 68000|
|         Judy|          29|Human Resources| 78000|
|        Kevin|          26|    Engineering| 62000|
|         Liam|          33|      Marketing| 60000|
|          Mia|          24|          Sales| 63000|
|         Noah|          38|    Engineering| 85000|
|       Olivia|          32|Human Resources| 82000|
|        Peter|          21|      Marketing| 52000|
|        Quinn|          36|          Sales| 72000|
|        Riley|          29|    Engineering| 70000|
|       Sophia|          27|Human Resources| 75000|
|       Thomas|          34|      Marketing| 65000|
+-------------+------------+---------------+------+

In [103]:
#drop coloumns

df.drop("Age", "Department").show()

drop_col = ("Age", "Department")
df.drop(*drop_col).show()

+-------+------+
|   Name|Salary|
+-------+------+
|  Alice| 60000|
|    Bob| 70000|
|Charlie| 55000|
|  David| 75000|
|    Eve| 65000|
|  Frank| 80000|
|  Grace| 58000|
|  Heidi| 72000|
|   Ivan| 68000|
|   Judy| 78000|
|  Kevin| 62000|
|   Liam| 60000|
|    Mia| 63000|
|   Noah| 85000|
| Olivia| 82000|
|  Peter| 52000|
|  Quinn| 72000|
|  Riley| 70000|
| Sophia| 75000|
| Thomas| 65000|
+-------+------+

+-------+------+
|   Name|Salary|
+-------+------+
|  Alice| 60000|
|    Bob| 70000|
|Charlie| 55000|
|  David| 75000|
|    Eve| 65000|
|  Frank| 80000|
|  Grace| 58000|
|  Heidi| 72000|
|   Ivan| 68000|
|   Judy| 78000|
|  Kevin| 62000|
|   Liam| 60000|
|    Mia| 63000|
|   Noah| 85000|
| Olivia| 82000|
|  Peter| 52000|
|  Quinn| 72000|
|  Riley| 70000|
| Sophia| 75000|
| Thomas| 65000|
+-------+------+

GROUPBY

In [105]:
#groupby

df.groupBy("Department").count().show()

df.groupBy("Department").sum("Salary").show()

df.groupBy("Department").avg("Salary").show()

df.groupBy("Department").min("Salary").show()

df.groupBy("Department").max("Salary").show()

+---------------+-----+
|     Department|count|
+---------------+-----+
|          Sales|    5|
|    Engineering|    6|
|      Marketing|    5|
|Human Resources|    4|
+---------------+-----+

+---------------+-----------+
|     Department|sum(Salary)|
+---------------+-----------+
|          Sales|     338000|
|    Engineering|     424000|
|      Marketing|     290000|
|Human Resources|     315000|
+---------------+-----------+

+---------------+-----------------+
|     Department|      avg(Salary)|
+---------------+-----------------+
|          Sales|          67600.0|
|    Engineering|70666.66666666667|
|      Marketing|          58000.0|
|Human Resources|          78750.0|
+---------------+-----------------+

+---------------+-----------+
|     Department|min(Salary)|
+---------------+-----------+
|          Sales|      63000|
|    Engineering|      60000|
|      Marketing|      52000|
|Human Resources|      75000|
+---------------+-----------+

+---------------+-----------+
|     Department|max(Salary)|
+---------------+-----------+
|          Sales|      72000|
|    Engineering|      85000|
|      Marketing|      65000|
|Human Resources|      82000|
+---------------+-----------+

In [116]:
#sum of salary with bounus
from pyspark.sql.functions import round
df.withColumn("Salary_increment", df["Salary"] * 1.05).groupBy("Department").sum("Salary_increment").show()
df.withColumn("Salary_increment", df["Salary"] * 1.05).show()
df.withColumn("Salary_diff", round(df["Salary"] * 1.05) - df["Salary"]).show()

+---------------+---------------------+
|     Department|sum(Salary_increment)|
+---------------+---------------------+
|          Sales|             354900.0|
|    Engineering|             445200.0|
|      Marketing|             304500.0|
|Human Resources|             330750.0|
+---------------+---------------------+

+-------+---+---------------+------+----------------+
|   Name|Age|     Department|Salary|Salary_increment|
+-------+---+---------------+------+----------------+
|  Alice| 25|    Engineering| 60000|         63000.0|
|    Bob| 30|          Sales| 70000|         73500.0|
|Charlie| 22|      Marketing| 55000|         57750.0|
|  David| 35|    Engineering| 75000|         78750.0|
|    Eve| 28|          Sales| 65000|         68250.0|
|  Frank| 40|Human Resources| 80000|         84000.0|
|  Grace| 23|      Marketing| 58000|         60900.0|
|  Heidi| 31|    Engineering| 72000|         75600.0|
|   Ivan| 27|          Sales| 68000|         71400.0|
|   Judy| 29|Human Resources| 78000|         81900.0|
|  Kevin| 26|    Engineering| 62000|         65100.0|
|   Liam| 33|      Marketing| 60000|         63000.0|
|    Mia| 24|          Sales| 63000|         66150.0|
|   Noah| 38|    Engineering| 85000|         89250.0|
| Olivia| 32|Human Resources| 82000|         86100.0|
|  Peter| 21|      Marketing| 52000|         54600.0|
|  Quinn| 36|          Sales| 72000|         75600.0|
|  Riley| 29|    Engineering| 70000|         73500.0|
| Sophia| 27|Human Resources| 75000|         78750.0|
| Thomas| 34|      Marketing| 65000|         68250.0|
+-------+---+---------------+------+----------------+

+-------+---+---------------+------+-----------+
|   Name|Age|     Department|Salary|Salary_diff|
+-------+---+---------------+------+-----------+
|  Alice| 25|    Engineering| 60000|     3000.0|
|    Bob| 30|          Sales| 70000|     3500.0|
|Charlie| 22|      Marketing| 55000|     2750.0|
|  David| 35|    Engineering| 75000|     3750.0|
|    Eve| 28|          Sales| 65000|     3250.0|
|  Frank| 40|Human Resources| 80000|     4000.0|
|  Grace| 23|      Marketing| 58000|     2900.0|
|  Heidi| 31|    Engineering| 72000|     3600.0|
|   Ivan| 27|          Sales| 68000|     3400.0|
|   Judy| 29|Human Resources| 78000|     3900.0|
|  Kevin| 26|    Engineering| 62000|     3100.0|
|   Liam| 33|      Marketing| 60000|     3000.0|
|    Mia| 24|          Sales| 63000|     3150.0|
|   Noah| 38|    Engineering| 85000|     4250.0|
| Olivia| 32|Human Resources| 82000|     4100.0|
|  Peter| 21|      Marketing| 52000|     2600.0|
|  Quinn| 36|          Sales| 72000|     3600.0|
|  Riley| 29|    Engineering| 70000|     3500.0|
| Sophia| 27|Human Resources| 75000|     3750.0|
| Thomas| 34|      Marketing| 65000|     3250.0|
+-------+---+---------------+------+-----------+

In [122]:
from pyspark.sql.functions import col, round, lit

# select and group by, then aggregate, filter, and show
df.groupBy("Department").agg({"Age": "avg", "Salary": "sum"}) \
    .where(col("Department") == "Engineering").show()

+-----------+-----------+------------------+
| Department|sum(Salary)|          avg(Age)|
+-----------+-----------+------------------+
|Engineering|     424000|30.666666666666668|
+-----------+-----------+------------------+

JOINS

In [ ]:
"""
PySpark JOIN TYPES
├── 1. Inner Join
│   ├── Aliases: "inner"
│   └── Description: Returns matching rows from both DataFrames
│
├── 2. Outer Joins
│   ├── 2.1 Full Outer Join
│   │   ├── Aliases: "outer", "full", "fullouter", "full_outer"
│   │   └── Description: Returns all rows, matching rows where available, else NULLs
│   │
│   ├── 2.2 Left Outer Join
│   │   ├── Aliases: "left", "leftouter", "left_outer"
│   │   └── Description: All rows from left DataFrame, matching rows from right
│   │
│   └── 2.3 Right Outer Join
│       ├── Aliases: "right", "rightouter", "right_outer"
│       └── Description: All rows from right DataFrame, matching rows from left
│
├── 3. Cross Join
│   ├── Alias: "cross"
│   └── Description: Cartesian product (every row with every other row)
│
├── 4. Left Semi Join
│   ├── Aliases: "semi", "leftsemi", "left_semi"
│   └── Description: Returns rows from left where a match exists in right (only left columns)
│
└── 5. Left Anti Join
    ├── Aliases: "anti", "leftanti", "left_anti"
    └── Description: Returns rows from left where NO match exists in right

    """

In [124]:
employee_data = [
    (1, "Alice", 25, 101),
    (2, "Bob", 30, 102),
    (3, "Charlie", 22, 103),
    (4, "David", 35, 101),
    (5, "Eve", 28, 102),
    (6, "Frank", 40, 104),
    (7, "Grace", 23, 103),
    (8, "Heidi", 31, 101),
    (9, "Ivan", 27, 102),
    (10, "Judy", 29, 104)
]

employee_columns = ["EmployeeID", "Name", "Age", "DepartmentID"]

employee_df = spark.createDataFrame(employee_data, employee_columns)

department_data = [
    (101, "Engineering"),
    (102, "Sales"),
    (103, "Marketing"),
    (104, "Human Resources"),
    (105, "Finance")
]

department_columns = ["DepartmentID", "DepartmentName"]

department_df = spark.createDataFrame(department_data, department_columns)

employee_df.show()
department_df.show()

+----------+-------+---+------------+
|EmployeeID|   Name|Age|DepartmentID|
+----------+-------+---+------------+
|         1|  Alice| 25|         101|
|         2|    Bob| 30|         102|
|         3|Charlie| 22|         103|
|         4|  David| 35|         101|
|         5|    Eve| 28|         102|
|         6|  Frank| 40|         104|
|         7|  Grace| 23|         103|
|         8|  Heidi| 31|         101|
|         9|   Ivan| 27|         102|
|        10|   Judy| 29|         104|
+----------+-------+---+------------+

+------------+---------------+
|DepartmentID| DepartmentName|
+------------+---------------+
|         101|    Engineering|
|         102|          Sales|
|         103|      Marketing|
|         104|Human Resources|
|         105|        Finance|
+------------+---------------+

In [125]:
#INNER-JION
employee_df.join(department_df, employee_df["DepartmentID"] == department_df["DepartmentID"], "inner").show()

+----------+-------+---+------------+------------+---------------+
|EmployeeID|   Name|Age|DepartmentID|DepartmentID| DepartmentName|
+----------+-------+---+------------+------------+---------------+
|         1|  Alice| 25|         101|         101|    Engineering|
|         4|  David| 35|         101|         101|    Engineering|
|         8|  Heidi| 31|         101|         101|    Engineering|
|         2|    Bob| 30|         102|         102|          Sales|
|         5|    Eve| 28|         102|         102|          Sales|
|         9|   Ivan| 27|         102|         102|          Sales|
|         3|Charlie| 22|         103|         103|      Marketing|
|         7|  Grace| 23|         103|         103|      Marketing|
|         6|  Frank| 40|         104|         104|Human Resources|
|        10|   Judy| 29|         104|         104|Human Resources|
+----------+-------+---+------------+------------+---------------+

In [126]:
#fullouter-join
employee_df.join(department_df, employee_df["DepartmentID"] == department_df["DepartmentID"], "fullouter").show()

+----------+-------+----+------------+------------+---------------+
|EmployeeID|   Name| Age|DepartmentID|DepartmentID| DepartmentName|
+----------+-------+----+------------+------------+---------------+
|         1|  Alice|  25|         101|         101|    Engineering|
|         4|  David|  35|         101|         101|    Engineering|
|         8|  Heidi|  31|         101|         101|    Engineering|
|         2|    Bob|  30|         102|         102|          Sales|
|         5|    Eve|  28|         102|         102|          Sales|
|         9|   Ivan|  27|         102|         102|          Sales|
|         3|Charlie|  22|         103|         103|      Marketing|
|         7|  Grace|  23|         103|         103|      Marketing|
|         6|  Frank|  40|         104|         104|Human Resources|
|        10|   Judy|  29|         104|         104|Human Resources|
|      NULL|   NULL|NULL|        NULL|         105|        Finance|
+----------+-------+----+------------+------------+---------------+

In [132]:
#leftouter-join
employee_df.join(department_df, employee_df["DepartmentID"] == department_df["DepartmentID"], "leftouter").show()
department_df.join(employee_df, employee_df["DepartmentID"] == department_df["DepartmentID"], "leftouter").show()

+----------+-------+---+------------+------------+---------------+
|EmployeeID|   Name|Age|DepartmentID|DepartmentID| DepartmentName|
+----------+-------+---+------------+------------+---------------+
|         3|Charlie| 22|         103|         103|      Marketing|
|         1|  Alice| 25|         101|         101|    Engineering|
|         4|  David| 35|         101|         101|    Engineering|
|         2|    Bob| 30|         102|         102|          Sales|
|         5|    Eve| 28|         102|         102|          Sales|
|         7|  Grace| 23|         103|         103|      Marketing|
|         6|  Frank| 40|         104|         104|Human Resources|
|        10|   Judy| 29|         104|         104|Human Resources|
|         8|  Heidi| 31|         101|         101|    Engineering|
|         9|   Ivan| 27|         102|         102|          Sales|
+----------+-------+---+------------+------------+---------------+

+------------+---------------+----------+-------+----+------------+
|DepartmentID| DepartmentName|EmployeeID|   Name| Age|DepartmentID|
+------------+---------------+----------+-------+----+------------+
|         101|    Engineering|         8|  Heidi|  31|         101|
|         101|    Engineering|         4|  David|  35|         101|
|         101|    Engineering|         1|  Alice|  25|         101|
|         102|          Sales|         9|   Ivan|  27|         102|
|         102|          Sales|         5|    Eve|  28|         102|
|         102|          Sales|         2|    Bob|  30|         102|
|         103|      Marketing|         7|  Grace|  23|         103|
|         103|      Marketing|         3|Charlie|  22|         103|
|         104|Human Resources|        10|   Judy|  29|         104|
|         104|Human Resources|         6|  Frank|  40|         104|
|         105|        Finance|      NULL|   NULL|NULL|        NULL|
+------------+---------------+----------+-------+----+------------+

In [141]:

# Corrected join using "DepartmentID" which exists in both dataframes
# Corrected join using "DepartmentID" which exists in both dataframes
left_data=employee_df.join(department_df, on="DepartmentID", how="left")
left_data.show()
left_data.groupBy("DepartmentName").count().show()
left_data.orderBy("Age", "DepartmentID").show()

+------------+----------+-------+---+---------------+
|DepartmentID|EmployeeID|   Name|Age| DepartmentName|
+------------+----------+-------+---+---------------+
|         103|         3|Charlie| 22|      Marketing|
|         101|         1|  Alice| 25|    Engineering|
|         101|         4|  David| 35|    Engineering|
|         102|         2|    Bob| 30|          Sales|
|         102|         5|    Eve| 28|          Sales|
|         103|         7|  Grace| 23|      Marketing|
|         104|         6|  Frank| 40|Human Resources|
|         104|        10|   Judy| 29|Human Resources|
|         101|         8|  Heidi| 31|    Engineering|
|         102|         9|   Ivan| 27|          Sales|
+------------+----------+-------+---+---------------+

+---------------+-----+
| DepartmentName|count|
+---------------+-----+
|          Sales|    3|
|    Engineering|    3|
|      Marketing|    2|
|Human Resources|    2|
+---------------+-----+

+------------+----------+-------+---+---------------+
|DepartmentID|EmployeeID|   Name|Age| DepartmentName|
+------------+----------+-------+---+---------------+
|         103|         3|Charlie| 22|      Marketing|
|         103|         7|  Grace| 23|      Marketing|
|         101|         1|  Alice| 25|    Engineering|
|         102|         9|   Ivan| 27|          Sales|
|         102|         5|    Eve| 28|          Sales|
|         104|        10|   Judy| 29|Human Resources|
|         102|         2|    Bob| 30|          Sales|
|         101|         8|  Heidi| 31|    Engineering|
|         101|         4|  David| 35|    Engineering|
|         104|         6|  Frank| 40|Human Resources|
+------------+----------+-------+---+---------------+